[
    {
        "name": "British Grand Prix",
        "country": "United Kingdom",
        "description": "<p>Гран-при Великобритании 1950 года, прошедший на автодроме в Сильверстоуне, стал первым в истории регулярных чемпионатов «Формулы-1». </p><p>До 1987 года место его проведения регулярно менялось. В разные периоды Гран-при проводился на трассах «Сильверстоун», «Брэндс Хэтч» (с 1964 по 1986, чередуясь ежегодно с Сильверстоуном) и в «Эйнтри» (больше известная, как трасса для скачек). А после 1987 года соревнования проводятся исключительно на автодроме «Сильверстоун».</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Великобритании"
    },
    {
        "name": "Monaco Grand Prix",
        "country": "Monaco",
        "description": "<p>Гран-при Монако проходит на городской трассе Монте-Карло. Проводится с первого чемпионата мира 1950 года по настоящее время (не был включён в чемпионат 1951—1954 годов).</p><p>С 1929 по 1948 годы до возникновения Формулы-1 Гран-при Монако по автогонкам проводились как независимые спортивные состязания.</p><p>Победа в Гран-при Монако считается одной из самых престижных в чемпионате Формулы-1.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Монако"
    },
    {
        "name": "Swiss Grand Prix",
        "country": "Switzerland",
        "description": "<p>Гран-при Швейцарии входил в чемпионат мира Формулы-1 в сезонах 1950-1954 (трасса Бремгартен) и 1982 годов (трасса Дижон во Франции, так как автогонки на территории Швейцарии были запрещены после аварии 1955 года в Ле-Мане, повлёкшей смерть 80 человек).</p><p>Первые 9 Гран-при Швейцарии проводились до 1950 года, пять из них входили в пред-военный Чемпионат Европы.</p><p>6 июня 2007 года швейцарский парламент продлил запрет на проведение гонок ещё на 5 лет.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Монако"
    },
    {
        "name": "Belgian Grand Prix",
        "country": "Belgium",
        "description": "<p>Впервые Гран-при Бельгии состоялось в 1925 году на трасса Спа-Франкоршам, проложенной по дорогам общего пользования в районе бельгийских городов Спа, Франкоршам, Малмеди и Ставелот.</p><p>В 1950 году Гран-при Бельгии было включено в первый чемпионат мира Формулы-1. Эту гонку выиграл Хуан-Мануэль Фанхио на Alfa Romeo.</p><p>На быстрой и длинной (длина круга более 14 километров) трассе Спа-Франкоршам нередко происходили тяжелые аварии. В результате, 1972 году трасса в Спа была признана несоответствующей требованиям безопасности, и Гран-при было перенесено сперва на автодром Нивель-Болер недалеко от Брюсселя, а затем на автодром Зольдер.</p><p>В 1983 году Гран-при прошло на модернизированной трассе Спа-Франкоршам (трасса была сокращена до 7 километров), и с 1985 года неизменно проходит именно на этой трассе — самой длинной трассе в календаре чемпионата Формулы-1.</p><p>Бельгийский этап — один из самых старых, интересных и престижных Гран-при.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Бельгии"
    },
    {
        "name": "French Grand Prix",
        "country": "France",
        "description": "<p>Гран-при Франции был включен в чемпионат мира с первого сезона 1950 года по 2008 год. После десятилетнего отсутствия, в 2018 году, Гран-при Франции вернулся в календарь.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Франции"
    },
    {
        "name": "Italian Grand Prix",
        "country": "Italy",
        "description": "<p>Гран-при Италии (итал. Gran Premio d'Italia) — один из старейших этапов чемпионата мира по автогонкам в классе «Формула-1». Непрерывно проводится с самого первого сезона «Формулы-1» и по сегодняшний день.</p><p>Все гонки Гран-при Италии «Формулы-1» традиционно проходят на автодроме Монца. Исключением стал лишь Гран-при Италии 1980 года, который был проведён на трассе в Имоле.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Италии"
    },
    {
        "name": "German Grand Prix",
        "country": "Germany",
        "description": "<p>Гран-при Германии — один из этапов чемпионата Мира по автогонкам в классе Формула 1. В 2007 году Гран-при Германии был исключен из календаря, вместо него был проведён Гран-при Европы на трассе Нюрбургринг. C 2007 года принято решение чередовать проведение Гран-при в Германии на трассах Нюрбургринг и Хоккенхаймринг.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Германии"
    },
    {
        "name": "Spanish Grand Prix",
        "country": "Spain",
        "description": "<p>Впервые Гран-при Испании был включен в календарь чемпионата Формулы-1 в 1951 году и прошёл на трассе Педралбес.</p><p>В 1954 году был проведен ещё один Гран-при Испании. Но в 1955 году произошла трагедия с гибелью зрителей на гонках 24 часа Ле-Мана, после которого уличную трассу Педралбес исключили из календаря.</p><p>С сезона 1991 года Гран-при Испании проводится на трассе Каталунья, расположенной близ Барселоны.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Испании"
    },
    {
        "name": "Dutch Grand Prix",
        "country": "Netherlands",
        "description": "<p>Гран-при Нидерландов проводился с 1948 по 1985 на автодроме Зандвоорт. С 1948 по 1951 год Гран-при Нидерландов не входил в календарь Формулы-1.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Нидерландов"
    },
    {
        "name": "Argentine Grand Prix",
        "country": "Argentina",
        "description": "<p>Гран-при Аргентины проводился с перерывами с 1953 по 1998 года в Буэнос-Айресе.</p><p>Президент Аргентины Хуан Доминго Перон был одной из главных инициаторов строительства автодрома для проведения национального Гран-при после успехов Хуана Мануэля Фанхио. Построенный недалеко от Буэнос-Айреса на заболоченной территории, автодром был открыт в марте 1952 года, проведением на ней «Кубка Перона», победу в котором одержал Хуан Мануэль Фанхио. В 1953 году, автодром принял первый в истории Гран-при Формулы-1, прошедший не в Европе.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Аргентины"
    },
    {
        "name": "Pescara Grand Prix",
        "country": "Italy",
        "description": "",
        "url": ""
    },
    {
        "name": "Portuguese Grand Prix",
        "country": "Portugal",
        "description": "<p>Гран-при Португалии начал проводиться в 1951 году на трассе Боавишта (в городе Порту). В 1958 году этап вошёл в чемпионат мира гонок Формулы-1. В 1958 этап прошёл на трассе в Лиссабоне (Монсанто-Парк), затем вернулся на год в Порту.</p><p>В 1972 году был открыт новый автодром Эшторил. В 70-х годах на нём проводились гонки в классе Формула-2. И в 1984 году официальные Гран-при Формулы-1 вернулись в Португалию. В первом же после перерыва португальском этапе, завершающем чемпионат, решилась судьба титула чемпионского титула - Ален Прост выиграл гонку, но уступил 0.5 очка в чемпионате Ники Лауде.</p><p>После 1996 года этапов в Португалии не проводилось.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Португалии"
    },
    {
        "name": "Moroccan Grand Prix",
        "country": "Morocco",
        "description": "<p>Гран-при Марокко входил в официальный чемпионат мира Формулы-1 только в одном сезоне. Победу в Гран-при Марокко 1958 года одержал пилот Vanwall Стирлинг Мосс.</p><p>До 1958 года на территории Марокко было проведено 13 Гран-при. Первые Гран-при носили название Гран-при Касабланки, поэтому Гран-при Марокко 1958 года был проведен под названием VII Grand Prix du Maroc.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Марокко"
    },
    {
        "name": "United States Grand Prix",
        "country": "United States of America",
        "description": "<p>Гран-при США включён в состав чемпионата мира Формулы-1 с сезона 1959 года. Большинство Гран-при США прошло на трассе Уоткинс-Глен.</p><p>До 2007 года (включительно) Гран-при США обычно проходил на автодроме «Индианаполис Мотор Спидвей» в Индианаполисе.</p><p>С 2008 по 2011 годы (включительно) этот Гран-при не проводился.</p><p>В 2012 году Формула-1 вернулась в США. Гран-при впервые прошёл на новом автодроме «Трасса Америк», который был построен в окрестностях города Остин, штат Техас. «Трасса Америк» стала первой автогоночной трассой в США, которая была построена специально для проведения на ней автогонок в классе Формула-1.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_США"
    },
    {
        "name": "South African Grand Prix",
        "country": "South Africa",
        "description": "<p>Гран-при Южной Африки впервые прошёл в 1934 году на трассе Prince George Circuit в городе Ист-Лондон. В гонке участвовали лучшие гонщики из Европы того времени, такие как Бернд Розмайер, Ричард «Дик» Симэн, и Луиджи Виллорези.</p><p>Вторая мировая война на время прервала проведение Гран-при в Ист-Лондоне, но 29 декабря 1962 году болиды Формулы-1 вернулись в Южную Африку. В 1967 году этап Гран-при был перенесён в Кьялами, где и проводился до 1993 года.</p><p>Всего, между 1962 и 1993 годами было проведено 23 Гран-при Южной Африки.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Южной_Африки"
    },
    {
        "name": "Mexican Grand Prix",
        "country": "Mexico",
        "description": "<p>Гран-при Мексики проводился в рамках чемпионата мира в сезонах 1963—1970, 1986—1992, 2015—2017, и как внечемпионатная гонка в 1962.</p><p>Все восемнадцать официальных Гран-при Формулы-1 прошли на трассе в Мехико.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Мексики"
    },
    {
        "name": "Austrian Grand Prix",
        "country": "Austria",
        "description": "<p>Гран-при Австрии входил в календарь чемпионата мира в 1964-2003 годах.</p><p>В 2014 году было объявлено, что Гран-при Австрии снова будет входить в календарь чемпионата мира по автогонкам в классе Формулы-1.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Австрии"
    },
    {
        "name": "Canadian Grand Prix",
        "country": "Canada",
        "description": "<p>Гран-при Канады проводится на автодроме имени Жиля Вильнёва, Монреаль, Канада. Включён в чемпионаты мира Формулы-1 с 1967 по 2018 годы, кроме чемпионатов 1975, 1987 и 2009 годов.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Канады"
    },
    {
        "name": "Brazilian Grand Prix",
        "country": "Brazil",
        "description": "<p>Гран-при Бразилии был впервые проведён на Интерлагосе в 1972 году. Первый Гран-при не являлся этапом чемпионата мира «Формулы-1», и только на следующий год он был включено в официальный календарь.</p><p>В 1978 году Гран-при Бразилии был перенесён на трассу Жакарепагуа (автодром имени Нельсона Пике) в Рио-де-Жанейро, ненадолго вернувшись на следующих два сезона в Интерлагос.</p><p>В 1990 году Гран-при окончательно возвращается в Интерлагос, где и проводится до сих пор.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Бразилии"
    },
    {
        "name": "Swedish Grand Prix",
        "country": "Sweden",
        "description": "<p>Гран-при Швеции проводился с 1973 по 1978 годы на трассе Андерсторп. В первом Гран-При Швеции победу одержал гонщик McLaren Дэнни Халм, в последнем - Ники Лауда за рулем Brabham BT46.</p><p>После смерти шведских гонщиков Ронни Петерсона и Гуннара Нильссона в 1978 году, интерес к Формуле-1 в Швеции пошел на спад, в связи с этим организаторы гонки в Андерсторпе, у которых имелись финансовые трудности, отозвали свою заявку на проведение Гран-При в 1979 году.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Швеции"
    },
    {
        "name": "United States Grand Prix West",
        "country": "United States of America",
        "description": "",
        "url": ""
    },
    {
        "name": "Japanese Grand Prix",
        "country": "Japan",
        "description": "<p>Гран-при Японии с 1976 года и по настоящее время является одним из этапов ежегодного чемпионата мира «Формулы-1».</p><p>Первые два Гран-при «Формулы-1» — в 1976 и 1977 годах — были проведены на трассе «Фудзи Спидвей», гора Фудзи, Ояма, Сидзуока. В период с 1978 по 1986 годы Гран-при Японии не проводился.</p><p>С 1987 года и по настоящее время традиционно проходит на трассе «Судзука», Судзука, Миэ. За это время он лишь два раза менял место своего проведения: в 2007 и 2008 Гран-при Японии вновь проходил на трассе «Фудзи Спидвей».</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Японии"
    },
    {
        "name": "San Marino Grand Prix",
        "country": "San Marino",
        "description": "",
        "url": ""
    },
    {
        "name": "Caesars Palace Grand Prix",
        "country": "United States of America",
        "description": "",
        "url": ""
    },
    {
        "name": "Detroit Grand Prix",
        "country": "United States of America",
        "description": "",
        "url": ""
    },
    {
        "name": "European Grand Prix",
        "country": "Europe",
        "description": "",
        "url": ""
    },
    {
        "name": "Dallas Grand Prix",
        "country": "United States of America",
        "description": "",
        "url": ""
    },
    {
        "name": "Australian Grand Prix",
        "country": "Australia",
        "description": "<p>Гран-при Австралии c 1996 года и по настоящее время проводится на трассе «Альберт Парк» в Мельбурне, в 1985-1995 проходил на трассе в Аделаиде.</p><p>История Гран-при Австралии начинается с 1928 года, однако только с сезона 1985 года Гран-при официально включён в чемпионат мира «Формула-1».</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Австралии"
    },
    {
        "name": "Hungarian Grand Prix",
        "country": "Hungary",
        "description": "<p>Гран-при Венгрии проводится на автодроме Хунгароринг, построенном вблизи города Будапешт.</p>",
        "url": ""
    },
    {
        "name": "Pacific Grand Prix",
        "country": "Japan",
        "description": "",
        "url": ""
    },
    {
        "name": "Luxembourg Grand Prix",
        "country": "Luxembourg",
        "description": "<p>Гран-при Люксембурга проводился в 1997 и 1998 годах на автодроме Нюрбургринг (Германия). В двух проведенных Гран-при победы одержали Мика Хаккинен (McLaren) и Жак Вильнёв (Williams).</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Люксембурга"
    },
    {
        "name": "Malaysian Grand Prix",
        "country": "Malaysia",
        "description": "<p>Гран-при Малайзии проводится с 1999 года на трассе Сепанг. Спонсором этапа является нефтяная компания Petronas.</p><p>В 2008 велись переговоры о проведении в 2009 году Гран-при Малайзии в ночное время, но позднее они были отложены по финансовым причинам.</p><p>Контракт на проведение Гран-при Малайзии истекал в 2018 году. 7 апреля 2017 году правительство страны заявило о досрочном его прекращении и о том, что гонка 1 октября 2017 года станет последней на этой трассе.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Малайзии"
    },
    {
        "name": "Bahrain Grand Prix",
        "country": "Bahrain",
        "description": "<p>Гран-при Бахрейна было организовано при поддержке национального аэроперевозчика Государства Бахрейн и Султаната Оман Gulf Air.</p><p>Впервые гонки прошли 4 апреля 2004 года. Гран-при Бахрейна является первым Гран-при в истории Формулы-1, прошедшим на территории Среднего Востока.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Бахрейна"
    },
    {
        "name": "Chinese Grand Prix",
        "country": "China",
        "description": "<p>Гран-при Китая впервые было проведено в 2004 году на новом автодроме в Шанхае. В первом Гран-при Китая одержал победу пилот Ferrari Рубенс Баррикелло.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Китая"
    },
    {
        "name": "Turkish Grand Prix",
        "country": "Turkey",
        "description": "<p>Гран-при Турции впервые было проведено в 2005 году на новом автодроме Истанбул Парк. В первом Гран-при Турции одержал победу пилот McLaren Кими Райкконен.</p><p>Трасса находится в Стамбуле в районе Тузла в азиатской части города. Строительство трассы было начато в декабре 2004 года.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Турции"
    },
    {
        "name": "Singapore Grand Prix",
        "country": "Singapore",
        "description": "<p>Гран-при Сингапура проводится с сезона 2008 года. Проходит на городской трассе по улицам города-государства Сингапур. Это первая в истории Формулы-1 гонка при искусственном освещении.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Сингапура"
    },
    {
        "name": "Abu Dhabi Grand Prix",
        "country": "United Arab Emirates",
        "description": "<p>Гран-при Абу-Даби — один из этапов чемпионата Мира по автогонкам в классе Формула-1.</p><p>Первая гонка на трассе, построенной на искусственном острове Яс, прошла в сезоне 2009 года, 1 ноября. Этап стал последним, 17-м в календаре.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Абу-Даби"
    },
    {
        "name": "Korean Grand Prix",
        "country": "South Korea",
        "description": "<p>Гран-при Кореи проводится с 2010 года на Международном автодроме Кореи. Договор заключён на 7 лет, с пятилетним опционом, т.е Гран-при может проходить вплоть до 2021.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Кореи"
    },
    {
        "name": "Indian Grand Prix",
        "country": "India",
        "description": "<p>Первая гонка Гран-при Индии прошла 30 октября 2011 года на трассе Международного автодрома Будды, расположенного в городе Большая Нойда, в 40 км от Дели.</p><p>Поул-позицию в этой дебютной гонке удалось завоевать пилоту команды Red Bull Себастьяну Феттелю. Сохранив лидерство на протяжении всей гонки, а также установив лучшее время круга, Феттель одержал победу, и впервые в карьере завоевал «большой шлем».</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Индии"
    },
    {
        "name": "Russian Grand Prix",
        "country": "Russia",
        "description": "<p>Гран-при России проводится в Cочи на трассе «Сочи Автодром» в Олимпийском парке с 2014 года.</p><p>14 октября 2010 года был подписан контракт на проведение Гран-при до 2020 года с опционом на продление. 27 февраля 2017 контракт на проведение российского этапа чемпионата мира был продлен до 2025 года.</p><p>Первая гонка состоялась 12 октября 2014 года.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_России"
    },
    {
        "name": "Azerbaijan Grand Prix",
        "country": "Azerbaijan",
        "description": "<p>Гран-при Азербайджана проводится c 2017 года на городской трассе в Баку. Годом ранее, в 2016 году, гонка на той же трассе прошла под названием Гран-при Европы.</p>",
        "url": "https://ru.wikipedia.org/wiki/Гран-при_Азербайджана"
    }
]